[
  {
    "title": "Former Seattle Sounders star Brad Evans has a new goal – to help charities with online auction startup",
    "source": {
      "date": "2021-06-07",
      "name": "Geekwire",
      "link": "https://www.geekwire.com/2021/former-seattle-sounders-star-brad-evans-new-goal-help-charities-online-auction-startup/"
    },
    "content": "The tech and business aspects of launching his own company may be foreign, but Evans is working with producers and a product that he knows well — sports stars and their memorabilia. The startup is called Contrib, and the digital fundraising platform is another way to connect athletes and other influencers with their fans while raising money for charity."
  },
  {
    "title": "Cloud tech vet Jared Wray launches Fons, a software startup for music teachers and private instructors",
    "source": {
      "date": "2017-02-02",
      "name": "Geekwire",
      "link": "http://www.geekwire.com/2017/cloud-tech-vet-jared-wray-launches-fons-software-startup-music-teachers-private-instructors"
    },
    "content": "Sometimes you choose your next career move and sometimes it chooses you. Longtime cloud exec Jared Wray’s next venture falls into that second category. He’d just left CenturyLink, two years after the telecom giant acquired his cloud computing startup Tier 3 and he was listening to his old friend, Eric Branner complain about the lack of effective software tools for running his guitar lesson business."
  },
  {
    "title": "CenturyLink loses two executives in shakeup at cloud unit",
    "source": {
      "date": "2015-11-30",
      "name": "Geekwire",
      "link": "http://www.geekwire.com/2015/centurylink-loses-two-executives-in-shakeup-at-cloud-unit/"
    },
    "content": "The departure of senior vice president of platform and application framework development Jared Wray and vice president of platform strategy and business development Jonathan King, first noted by Fortune, comes less than a year after Andrew Higginbotham left the company. Higginbotham and King led the purchase of Wray’s Tier 3, which helped CenturyLink build its cloud platform."
  },
  {
    "title": "Wray Reshaping CenturyLink Cloud Operation",
    "source": {
      "date": "2015-06-12",
      "name": "Light Reading",
      "link": "http://www.lightreading.com/business-employment/business-transformation/wray-reshaping-centurylink-cloud-operation/d/d-id/716275"
    },
    "content": "In the two months Wray has been running the broader organization, the cloud pioneer has implemented dramatic changes in how work is done and expects to double the output of his assembled team as a result."
  },
  {
    "title": "Jared Wray, CTO, CenturyLink: On change for telcos as they move to the cloud",
    "source": {
      "date": "2015-11-17",
      "name": "Cloudtech",
      "link": "http://www.cloudcomputing-news.net/news/2014/nov/17/jared-wray-cto-centurylink-change-telcos-they-move-cloud/"
    },
    "content": "CenturyLink is a cloud provider on a mission. With nearly fifty years’ experience in the traditional telecommunications space, it’s looking to challenge the main storage and infrastructure players."
  },
  {
    "title": "Nextcast Q&A: Tier 3 co-founder Jared Wray on the future of cloud computing",
    "source": {
      "date": "2013-08-18",
      "name": "Geekwire",
      "link": "http://www.geekwire.com/2013/nextcast-qa-tier-3-cofounder-jared-wray/"
    },
    "content": "How did Wray become an entrepreneur? He says: It came from being broke. Growing up in a family that struggled to make ends meet, Wray got used to the idea that you have to work hard to make something happen. And that lesson stuck, he says. Innovation and the will to make something happen."
  },
  {
    "title": "Inside CenturyLink’s fast-growing dev center: Shaking up the cloud with innovative work spaces",
    "source": {
      "date": "2014-10-14",
      "name": "Geekwire",
      "link": "http://www.geekwire.com/2014/inside-centurylinks-fast-growing-cloud-center-telecom/"
    },
    "content": "The telecommunications giant, which purchased Bellevue-based cloud computing startup Tier 3 last year, has big expansion plans in store for the Seattle area. And that expansion ties directly to the newly-opened cloud development center, which now occupies 30,000 square feet in the One Twelfth @ Twelfth building."
  },
  {
    "title": "Palmetto Elevates Chief Technology Officer Jared Wray to Co-Founder",
    "source": {
      "date": "2021-03-25",
      "name": "PRNewswire",
      "link": "https://www.prnewswire.com/news-releases/palmetto-elevates-chief-technology-officer-jared-wray-to-co-founder-301256257.html"
    },
    "content": "Palmetto, a rapidly growing technology company accelerating the national adoption of clean energy, announced today that it is acknowledging the transformational, multi-year business contributions of Chief Technology Officer (CTO) Jared Wray by creating a new position for him - the post of Palmetto co-founder. Wray, whose full title is now CTO and co-founder, is credited with accelerating Palmetto's technology evolution to an online clean energy marketplace."
  }
]
